НВ_Доработки/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПеремещениеТоваров</Name>
		</Properties>
	</Document>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/Documents/ПеремещениеТоваров/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура НВД_ОбработкаПроведения(Отказ, Режим)

	Если СозданПриИспользованииСтатусовПеремещений 
		#Удаление
		И (ТекущийСтатус = Перечисления.СтатусыПеремещений.Заявка ИЛИ ТекущийСтатус = Перечисления.СтатусыПеремещений.Собран) Тогда
		#КонецУдаления
		#Вставка
		И (ТекущийСтатус = Перечисления.СтатусыПеремещений.Заявка ИЛИ ТекущийСтатус = Перечисления.СтатусыПеремещений.Отменен) Тогда //ИЛИ ТекущийСтатус = Перечисления.СтатусыПеремещений.Собран) Тогда //nva
		#КонецВставки
		Возврат;
	КонецЕсли;

	ТребуетсяПриходНаСклад = (НЕ СозданПриИспользованииСтатусовПеремещений
	ИЛИ СозданПриИспользованииСтатусовПеремещений И ТекущийСтатус = Перечисления.СтатусыПеремещений.Получен);

	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;

	//ТоварыНаСкладах (расход)
	ТоварыНаСкладахДатаРасхода = Дата;
	Если СозданПриИспользованииСтатусовПеремещений Тогда
		#Удаление
		ТоварыНаСкладахДатаРасхода = ДатаОтправлено;
		#КонецУдаления
		#Вставка
		Если ТекущийСтатус = Перечисления.СтатусыПеремещений.Собран Тогда
			ТоварыНаСкладахДатаРасхода = ДатаСобрано;
		Иначе	
			ТоварыНаСкладахДатаРасхода = ДатаОтправлено;
		КонецЕсли;	
		#КонецВставки
	ИначеЕсли ТоварыНаСкладахДатаРасхода = Дата(1,1,1) Тогда
		ТоварыНаСкладахДатаРасхода = ТекущаяДатаСеанса();
	КонецЕсли;

	Движения.ТоварыНаСкладах.Записывать = Истина;
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, СкладОтправитель, Товары, ТоварыНаСкладахДатаРасхода);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	//++ №8793 товары нужно свернуть, чтобы корректно списать себестоимость
	мТовары = Товары.Выгрузить();
	мТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество");
	мТовары.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
	мТовары.Колонки.Добавить("СуммаВал",Новый ОписаниеТипов("Число"));
	//-- №8793
	Для Каждого СтрокаТовара Из мТовары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТоварыНаСкладахДатаРасхода;
		Движение.Организация = ОрганизацияТоваров;
		Движение.Склад = СкладОтправитель;
		Движение.Номенклатура = СтрокаТовара.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = СтрокаТовара.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = СтрокаТовара.СерияНоменклатуры;
		Движение.Количество = СтрокаТовара.Количество * СтрокаТовара.Коэффициент;
		//#8288
		//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ТоварыНаСкладахДатаСписания, ОрганизацияТоваров, СкладОтправитель, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
		СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ТоварыНаСкладахДатаРасхода, ОрганизацияТоваров, СкладОтправитель, Движение.Номенклатура, Движение.ХарактеристикаНоменклатуры, Движение.СерияНоменклатуры);
		Движение.Сумма = Движение.Количество * СтруктураЦенОстатков.Цена;
		Движение.СуммаВал = Движение.Количество * СтруктураЦенОстатков.ЦенаВал;

		СтрокаТовара.Сумма = Движение.Сумма;
		СтрокаТовара.СуммаВал = Движение.СуммаВал;
	КонецЦикла; 
	
	#Вставка 
	
	лТовары = Товары.Выгрузить();
	лТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", "Количество");
	лТовары.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
    лТовары.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	лТовары.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
	лТовары.ЗаполнитьЗначения(Перечисления.ВидыТабличнойЧасти.Товары, "ВидТабличнойЧасти");
	лТовары.ЗаполнитьЗначения(СкладОтправитель, "Склад"); 
	лТовары.ЗаполнитьЗначения(Ссылка.Основание, "Заказ");
	//найти заказ покупателя и заполнить соответствующую колонку
		
	рзТовары = НВД_ПолучитьОстаткиПоРезервамНамоментВремени(Ссылка.МоментВремени(), лТовары, ОрганизацияТоваров);
	
	Для Каждого Товар Из рзТовары Цикл
		Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
		Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТоварыНаСкладахДатаРасхода;
		Движение.ДокументРезерва = Товар.ДокументРезерва;
		Движение.Организация = Товар.Организация;
		Движение.Склад = Товар.Склад;			
		Движение.Номенклатура = Товар.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Движение.ВидТабличнойЧасти = Товар.ВидТабличнойЧасти;
		Движение.Количество = ?(Товар.КоличествоВДокументе > Товар.КоличествоВРезерве, Товар.КоличествоВРезерве, Товар.КоличествоВДокументе);			
	КонецЦикла; 
	
	Если СозданПриИспользованииСтатусовПеремещений Тогда 
		
		Для Каждого Товар Из рзТовары Цикл
			Движения.ТоварыВРезервеВпути.Записывать = Истина;
			Движение = Движения.ТоварыВРезервеВпути.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ТоварыНаСкладахДатаРасхода;
			Движение.ДокументРезерва = Товар.ДокументРезерва;
			Движение.Организация = Товар.Организация;
			Движение.Склад = Товар.Склад;			
			Движение.Номенклатура = Товар.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Движение.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Движение.ВидТабличнойЧасти = Товар.ВидТабличнойЧасти;
			Движение.Количество = ?(Товар.КоличествоВДокументе > Товар.КоличествоВРезерве, Товар.КоличествоВРезерве, Товар.КоличествоВДокументе);			
		КонецЦикла;
		
	КонецЕсли;	
	
	#КонецВставки

	//ТоварыВПутиНаСкладах (приход)
	Если СозданПриИспользованииСтатусовПеремещений Тогда
		Движения.ТоварыВПутиНаСкладах.Записывать = Истина;
		Для Каждого Товар Из мТовары Цикл
			Движение = Движения.ТоварыВПутиНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			#Удаление
			Движение.Период = ДатаОтправлено;
			#КонецУдаления
			#Вставка
			Если ТекущийСтатус = Перечисления.СтатусыПеремещений.Собран Тогда
				Движение.Период = ДатаСобрано;
			Иначе	
				Движение.Период = ДатаОтправлено;
			КонецЕсли;
			#КонецВставки
			Движение.СкладОтправитель = СкладОтправитель;
			Движение.СкладПолучатель = СкладПолучатель;
			Движение.Номенклатура = Товар.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Движение.Количество = Товар.Количество * Товар.Коэффициент;
		КонецЦикла;	
	КонецЕсли;

	//ТаблицаТоваров = Новый ТаблицаЗначений;
	//ТаблицаТоваров = Товары.Выгрузить();
	//ТаблицаТоваров.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
	//ЗаполнитьСтоимостьПриходаПоСписанию(ТаблицаТоваров);

	//ТоварыНаСкладах (приход)
	Если ТребуетсяПриходНаСклад Тогда
		ТоварыНаСкладахДатаПрихода = Дата;
		Если СозданПриИспользованииСтатусовПеремещений Тогда
			ТоварыНаСкладахДатаПрихода = ДатаПолучено;
		КонецЕсли;
		//Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		Для Каждого СтрокаТовара Из мТовары Цикл
			Движение = Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ТоварыНаСкладахДатаПрихода;
			Движение.Организация = ОрганизацияТоваров;
			Движение.Склад = СкладПолучатель;
			Движение.Номенклатура = СтрокаТовара.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = СтрокаТовара.ХарактеристикаНоменклатуры;
			Движение.СерияНоменклатуры = СтрокаТовара.СерияНоменклатуры;
			Движение.Количество = СтрокаТовара.Количество * СтрокаТовара.Коэффициент;
			// #16858 исправлено на суммы списания
			//Двиижение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СтрокаТовара.Сумма);
			//Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, СтрокаТовара.Сумма); //#8288
			Движение.Сумма = СтрокаТовара.Сумма;
			Движение.СуммаВал = СтрокаТовара.СуммаВал;
		КонецЦикла;
	КонецЕсли;
	
	#Вставка
	Если ТребуетсяПриходНаСклад Тогда
		ТоварыНаСкладахДатаПрихода = Дата;
		Если СозданПриИспользованииСтатусовПеремещений Тогда
			ТоварыНаСкладахДатаПрихода = ДатаПолучено;
		КонецЕсли;
		Для Каждого Товар Из рзТовары Цикл
			Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
			Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ТоварыНаСкладахДатаРасхода;
			Движение.ДокументРезерва = Товар.ДокументРезерва;
			Движение.Организация = ОрганизацияТоваров;
			Движение.Склад = СкладПолучатель;			
			Движение.Номенклатура = Товар.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Движение.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Движение.ВидТабличнойЧасти = Перечисления.ВидыТабличнойЧасти.Товары;
			Движение.Количество = ?(Товар.КоличествоВДокументе > Товар.КоличествоВРезерве, Товар.КоличествоВРезерве, Товар.КоличествоВДокументе);			
		КонецЦикла;
	КонецЕсли;
	
	Если СозданПриИспользованииСтатусовПеремещений И ТекущийСтатус = Перечисления.СтатусыПеремещений.Получен Тогда 
		
		Для Каждого Товар Из рзТовары Цикл
			Движения.ТоварыВРезервеВпути.Записывать = Истина;
			Движение = Движения.ТоварыВРезервеВпути.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ТоварыНаСкладахДатаРасхода;
			Движение.ДокументРезерва = Товар.ДокументРезерва;
			Движение.Организация = ОрганизацияТоваров;
			Движение.Склад = СкладОтправитель;			
			Движение.Номенклатура = Товар.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Движение.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Движение.ВидТабличнойЧасти = Перечисления.ВидыТабличнойЧасти.Товары;
			Движение.Количество = ?(Товар.КоличествоВДокументе > Товар.КоличествоВРезерве, Товар.КоличествоВРезерве, Товар.КоличествоВДокументе);			
		КонецЦикла;
		
	КонецЕсли;
	#КонецВставки

	//ТоварыВПутиНаСкладах (расход)
	Если СозданПриИспользованииСтатусовПеремещений И ТекущийСтатус = Перечисления.СтатусыПеремещений.Получен Тогда
		Движения.ТоварыВПутиНаСкладах.Записывать = Истина;
		Для Каждого Товар Из мТовары Цикл
			Движение = Движения.ТоварыВПутиНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаПолучено;
			Движение.СкладОтправитель = СкладОтправитель;
			Движение.СкладПолучатель = СкладПолучатель;
			Движение.Номенклатура = Товар.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Движение.Количество = Товар.Количество * Товар.Коэффициент;
		КонецЦикла;	
	КонецЕсли;
	
	//ТоварыПроизводстваВПути
	Движения.ТоварыПроизводстваВПути.Записывать = Истина;
	Для Каждого ТекСтрока Из Товары Цикл
		Если ТекСтрока.Заказ.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		НоваяЗапись = Движения.ТоварыПроизводстваВПути.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Активность = Истина;
		НоваяЗапись.Заказ = ТекСтрока.Заказ;					
		НоваяЗапись.СкладОтправитель = СкладОтправитель;
		НоваяЗапись.СкладПолучатель = СкладПолучатель;	
		НоваяЗапись.Номенклатура = ТекСтрока.Номенклатура;
		НоваяЗапись.КоличествоОтправлено = ТекСтрока.Количество * ТекСтрока.Коэффициент;	
	КонецЦикла;
	Если (НЕ СозданПриИспользованииСтатусовПеремещений И Получено) 
		ИЛИ (СозданПриИспользованииСтатусовПеремещений И ТекущийСтатус = Перечисления.СтатусыПеремещений.Получен) Тогда
		Для Каждого ТекСтрока Из Товары Цикл
			Если ТекСтрока.Заказ.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			НоваяЗапись = Движения.ТоварыПроизводстваВПути.Добавить();
			НоваяЗапись.Период = ?(НЕ СозданПриИспользованииСтатусовПеремещений, ПолученоДата, ДатаПолучено);
			НоваяЗапись.Активность = Истина;
			НоваяЗапись.Заказ = ТекСтрока.Заказ;							
			НоваяЗапись.СкладОтправитель = СкладОтправитель;
			НоваяЗапись.СкладПолучатель = СкладПолучатель;
			НоваяЗапись.Номенклатура = ТекСтрока.Номенклатура;
			НоваяЗапись.КоличествоПолучено = ТекСтрока.Количество * ТекСтрока.Коэффициент;
		КонецЦикла;
	КонецЕсли;

	//ПотребностьВМатериалахДляМонтажа
	Движения.ПотребностьВМатериалахДляМонтажа.Записывать = Истина;
	Если ТипЗнч(Назначение) = Тип("ДокументСсылка.Монтаж") И НЕ Назначение.Пустая() Тогда
		Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Выдача Тогда
			Для Каждого ТекСтрокаТовары Из Товары Цикл
				Расход = Движения.ПотребностьВМатериалахДляМонтажа.Добавить();
				Расход.Период 							= Дата;
				Расход.ВидДвижения 						= ВидДвиженияНакопления.Расход;
				Расход.Монтаж 							= Назначение;
				Расход.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
				Расход.Количество 						= ТекСтрокаТовары.Количество * ТекСтрокаТовары.Коэффициент;
			КонецЦикла;
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Возврат Тогда
			Для Каждого ТекСтрокаТовары Из Товары Цикл
				Расход = Движения.ПотребностьВМатериалахДляМонтажа.Добавить();
				Расход.Период 							= Дата;
				Расход.ВидДвижения 						= ВидДвиженияНакопления.Расход;
				Расход.Монтаж 							= Назначение;
				Расход.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
				Расход.Количество 						= -1 * (ТекСтрокаТовары.Количество * ТекСтрокаТовары.Коэффициент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	// регистр ТоварыВРезервеНаСкладах Расход (15815)
	Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
	Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Выдача Тогда
		// Получим выборку по резерву
		Выборка = РегистрыНакопления.ТоварыВРезервеНаСкладах.КонтрольРезерва(Основание, Организация, СкладОтправитель, Дата, Товары);
		Пока Выборка.Следующий() Цикл
			Если Выборка.КоличествоРезерве > 0 Тогда
				Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ВидТабличнойЧасти = Перечисления.ВидыТабличнойЧасти.Товары;
				Движение.ДокументРезерва = Основание;
				Движение.Организация = Организация;
				Движение.Склад = СкладОтправитель;
				Движение.Номенклатура = Выборка.Номенклатура;
				Движение.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
				Движение.СерияНоменклатуры = Выборка.СерияНоменклатуры;
				Движение.Количество = ?(Выборка.Количество*Выборка.Коэффициент > Выборка.КоличествоРезерве, Выборка.КоличествоРезерве, Выборка.Количество*Выборка.Коэффициент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Получение остатков по резервам
Функция НВД_ПолучитьОстаткиПоРезервамНамоментВремени(МоментВремени, СписокПозиций, Организация)
	
	//++ №13982 на случай, когда резервы списываются по заказу покупателя, сделаем заглушку
	Если СписокПозиций.Колонки.Найти("ЗаказДоговор") = Неопределено Тогда
		СписокПозиций.Колонки.Добавить("ЗаказДоговор", новый ОписаниеТипов("ДокументСсылка.ЗаказДоговор"));
	КонецЕсли;
	//-- №13982
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Организация КАК Организация,
	|	Позиции.Склад КАК Склад,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Позиции.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Позиции.Заказ КАК ДокументРезерва,
	//++ №13982
	|	Позиции.ЗаказДоговор КАК ЗаказДоговор,
	//-- №13982
	|	Позиции.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	Позиции.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Позиции			
	|ИЗ
	|	&СписокТоваров КАК Позиции
	|;	
	|//////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Позиции.Организация КАК Организация,
	|	Позиции.Склад КАК Склад,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Позиции.ДокументРезерва КАК ДокументРезерва,
	//++ №13982
	|	Позиции.ЗаказДоговор КАК ЗаказДоговор,
	//-- №13982
	|	Позиции.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Позиции.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(Позиции.Количество, 0) КАК КоличествоВДокументе,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоВРезерве,
	//++ №13982
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиПоДоговору.КоличествоОстаток, 0) КАК КоличествоВРезервеПоДоговору
	//-- №13982
	|ИЗ
	|	ВТ_Позиции КАК Позиции
	|
	// №11431|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ТекДата) КАК ТоварыВРезервеНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&МоментВремени) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО Позиции.Организация = ТоварыВРезервеНаСкладахОстатки.Организация
	|			И Позиции.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
	|			И Позиции.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И Позиции.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И Позиции.ДокументРезерва = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
	|			И Позиции.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры
	|			И Позиции.ВидТабличнойЧасти = ТоварыВРезервеНаСкладахОстатки.ВидТабличнойЧасти
	|		
	//++ №13982
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&МоментВремени) КАК ТоварыВРезервеНаСкладахОстаткиПоДоговору
	|		ПО Позиции.Организация = ТоварыВРезервеНаСкладахОстаткиПоДоговору.Организация
	|			И Позиции.Склад = ТоварыВРезервеНаСкладахОстаткиПоДоговору.Склад
	|			И Позиции.Номенклатура = ТоварыВРезервеНаСкладахОстаткиПоДоговору.Номенклатура
	|			И Позиции.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстаткиПоДоговору.ХарактеристикаНоменклатуры
	|			И Позиции.ЗаказДоговор = ТоварыВРезервеНаСкладахОстаткиПоДоговору.ДокументРезерва
	|			И Позиции.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстаткиПоДоговору.СерияНоменклатуры
	|			И Позиции.ВидТабличнойЧасти = ТоварыВРезервеНаСкладахОстаткиПоДоговору.ВидТабличнойЧасти
	//-- №13982
	|
	|ГДЕ
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	//++ №13982
	|	Или ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиПоДоговору.КоличествоОстаток, 0) > 0
	//-- №13982
	|
	|";
	// №11431 комментируем т.к. остатки резервов берем на текущую дату Запрос.УстановитьПараметр("ТекДата", Дата);
	Запрос.УстановитьПараметр("СписокТоваров", СписокПозиций);
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
